Repository: JacksonOsvaldo/python-guide-pt_br
Catalog: docs/locale/*/LC_MESSAGES/intro/learning.po
Languages: pt_br

source: Learning Python
pt_br: Aprendendo Python

source: Beginner
pt_br: Iniciante

source: The Python Tutorial
pt_br: O Tutorial Python

source: This is the official tutorial. It covers all the basics, and offers a tour of the language and the standard library. Recommended for those who need a quick-start guide to the language.
pt_br: Este é o tutorial oficial. Ele cobre toda a parte básica e oferece um tour da linguagem e da biblioteca principal. Recomendado para aqueles que necessitam de um guia de iniciação rápida para a linguagem.

source: Python for Beginners
pt_br: Python para iniciantes

source: thepythonguru.com is a tutorial focuses on beginner programmers. It covers many python concepts in depth. It also teaches you some advance constructs of python like lambda expression, regular expression. At last it finishes off with tutorial "How to access MySQL db using python"
pt_br: thepythonguru.com é um tutorial voltado para programadores iniciantes. Ele cobre muitos conceitos de python a fundo. Ele também ensina a você algumas construções avançadas em python como a expressão lambda, expressão regular. Ao final, é encerrado com o tutorial " Como acessar o MySQL db usando python "

source: `Python for beginners <http://thepythonguru.com/>`_
pt_br: `Python para iniciantes <http://thepythonguru.com/>`_

source: Learn Python Interactive Tutorial
pt_br: Tutorial Interativo Learn Python

source: Learnpython.org is an easy non-intimidating way to get introduced to Python. The website takes the same approach used on the popular `Try Ruby <http://tryruby.org/>`_ website, it has an interactive Python interpreter built into the site that allows you to go through the lessons without having to install Python locally.
pt_br: learnpython.org é um modo fácil e não intimidador de ser introduzido ao Python. O site toma a mesma aproximação utilizada no popular website `Try Ruby <http://tryruby.org/>`_, possui um interpretador interativo de Python dentro do próprio website que permite a você avançar pelas lições sem ter o Python instalado localmente.

source: If you want a more traditional book, *Python For You and Me* is an excellent resource for learning all aspects of the language.
pt_br: Se você quer um livro mais tradicional, *Python For You and Me* é um excelente recurso para aprender todos os aspectos da linguagem.

source: Online Python Tutor
pt_br: Python Tutor Online

source: Online Python Tutor gives you a visual step by step representation of how your program runs. Python Tutor helps people overcome a fundamental barrier to learning programming by understanding what happens as the computer executes each line of a program's source code.
pt_br: O Tutor Python Online dá a você uma representação visual do passo a passo de como o seu programa roda. O Python Tutor ajuda pessoas a superar uma barreira fundamental no aprendizado da programação através do entendimento do que acontece quando o computador executa cada linha do código fonte de um programa.

source: `Online Python Tutor <http://pythontutor.com/>`_
pt_br: `Python Tutor Online <http://pythontutor.com/>`_

source: Invent Your Own Computer Games with Python
pt_br: Invente Seus Próprios Jogos de Computador com Python

source: This beginner's book is for those with no programming experience at all. Each chapter has the source code to a small game, using these example programs to demonstrate programming concepts to give the reader an idea of what programs "look like".
pt_br: Esse livro de iniciantes é para aqueles sem nenhuma experiência com programação. Cada capítulo possui o código fonte de um pequeno jogo, utilizando esses programas de exemplo para demonstrar conceitos de programação, dando ao leitor uma ideia do que um programa "parece".

source: `Invent Your Own Computer Games with Python <http://inventwithpython.com/>`_
pt_br: `invente seus próprios jogos de computador com Python <http://inventwithpython.com/>`_

source: Hacking Secret Ciphers with Python
pt_br: Hackeando Cifras Secretas com Python

source: This book teaches Python programming and basic cryptography for absolute beginners. The chapters provide the source code for various ciphers, as well as programs that can break them.
pt_br: Este livro ensina programação em Python e criptografia básica para iniciantes completos. Os capítulos disponibilizam o código fonte de várias cifras, assim como os programas que podem quebrá-las.

source: `Hacking Secret Ciphers with Python <http://inventwithpython.com/hacking/>`_
pt_br: `Hackeando Cifras Secretas com Python <http://inventwithpython.com/hacking/>`_

source: Learn Python the Hard Way
pt_br: Aprenda Python da Maneira Mais Difícil

source: This is an excellent beginner programmer's guide to Python. It covers "hello world" from the console to the web.
pt_br: Esse é um excelente guia de programação para iniciantes em Python. Ele cobre o "hello world" do console até a web.

source: `Learn Python the Hard Way <http://learnpythonthehardway.org/book/>`_
pt_br: `Aprenda Python da Maneira Mais Difícil <http://learnpythonthehardway.org/book/>`_

source: Crash into Python
pt_br: Mergulhando em Python

source: Also known as *Python for Programmers with 3 Hours*, this guide gives experienced developers from other languages a crash course on Python.
pt_br: Também conhecido como *Python para Programadores com 3 horas*, esse guia dá a desenvolvedores experientes com outras linguagens um curso intensivo de Python.

source: `Crash into Python <http://stephensugden.com/crash_into_python/>`_
pt_br: `Mergulhando em Python <http://stephensugden.com/crash_into_python/>`_

source: Dive Into Python 3
pt_br: Mergulhando em Python 3

source: Dive Into Python 3 is a good book for those ready to jump in to Python 3. It's a good read if you are moving from Python 2 to 3 or if you already have some experience programming in another language.
pt_br: Mergulhando em Python 3 é um bom livro para aqueles prontos para pular pra dentro do Python 3. É uma boa leitura se você está mudando de Python 2 para 3 ou se você já tem alguma experiência em programação com outra linguagem.

source: `Dive Into Python 3 <http://www.diveinto.org/python3/>`_
pt_br: `Mergulhando em Python 3 <http://www.diveinto.org/python3/>`_

source: Think Python: How to Think Like a Computer Scientist
pt_br: Pense Python: Como Pensar como um Cientista da Computação

source: Think Python attempts to give an introduction to basic concepts in computer science through the use of the Python language. The focus was to create a book with plenty of exercises, minimal jargon and a section in each chapter devoted to the subject of debugging.
pt_br: Pense Python tenta dar uma introdução a conceitos básicos de ciência da computação através do uso da linguagem Python. O foco era criar um livro com muitos exercícios, jargão mínimo e uma seção em cada capítulo devotada ao objeto de depuração.

source: While exploring the various features available in the Python language the author weaves in various design patterns and best practices.
pt_br: Enquanto explora as várias características disponíveis na linguagem Python, o autor entrelaça vários padrões de projeto e boas práticas.

source: The book also includes several case studies which have the reader explore the topics discussed in the book in greater detail by applying those topics to real-world examples. Case studies include assignments in GUI and Markov Analysis.
pt_br: O livro também inclui muitos estudos de caso que fazem com que o leitor explore os tópicos discutidos no livro em grandes detalhes, através da aplicação desses tópicos a exemplos do mundo real. Os estudos de caso incluem atribuições em GUI e Análise de Markov.

source: `Think Python <http://greenteapress.com/thinkpython/html/index.html>`_
pt_br: `Pense Python <http://greenteapress.com/thinkpython/html/index.html>`_

source: Python Koans is a port of Edgecase's Ruby Koans. It uses a test-driven approach, q.v. TEST DRIVEN DESIGN SECTION to provide an interactive tutorial teaching basic Python concepts. By fixing assertion statements that fail in a test script, this provides sequential steps to learning Python.
pt_br: O Python Koans é uma adaptação do Ruby Koans, do Edgecase. Ele usa uma lógica baseada em testes, vulgo TEST DRIVEN DESIGN SECTION* para prover um tutorial interativo ensinando conceitos básicos de Python. Arrumando declarações de asserções erradas que falham em um código teste, ele provê passos sequenciais para aprender Python. *NT: "SEÇÃO DE DESIGN BASEADA EM TESTES"

source: For those used to languages and figuring out puzzles on their own, this can be a fun, attractive option. For those new to Python and programming, having an additional resource or reference will be helpful.
pt_br: Para aqueles acostumados a linguagens e a descobrir puzzles por conta própria, pode ser uma opção atrativa e divertida. Para aqueles novos em Python e em programação, ter um recurso ou referência adicional será útil.

source: More information about test driven development can be found at these resources:
pt_br: Mais informações sobre desenvolvimento orientado a testes podem ser encontrados nesses recursos:

source: `Test Driven Development <http://en.wikipedia.org/wiki/Test-driven_development>`_
pt_br: `Desenvolvimento baseado em testes <http://en.wikipedia.org/wiki/Test-driven_development>`_

source: A Byte of Python
pt_br: Um Byte de Python

source: A free introductory book that teaches Python at the beginner level, it assumes no previous programming experience.
pt_br: Um livro grátis introdutório que ensina Python em um nível iniciante, sem que nenhuma experiência anterior em programação seja necessária.

source: `A Byte of Python for Python 2.x <http://www.ibiblio.org/swaroopch/byteofpython/read/>`_ `A Byte of Python for Python 3.x <http://swaroopch.com/notes/Python_en-Preface/>`_
pt_br: `Um Byte de Python para Python 2.x <http://www.ibiblio.org/swaroopch/byteofpython/read/>`_ `Um Byte de Python para Python 3.x <http://swaroopch.com/notes/Python_en-Preface/>`_

source: Learn to Program in Python with Codeacademy
pt_br: Aprenda a Programar Python com Codeacademy

source: A Codeacademy course for the absolute Python beginner. This free and interactive course provides and teaches the basics (and beyond) of Python programming whilst testing the user's knowledge in between progress. This course also features a built-in interpreter for receiving instant feedback on your learning.
pt_br: Um curso na Codeacademy para o iniciante completo em Python. Esse curso grátis e interativo disponibiliza e ensina o básico (e além) da programação em Python, enquanto testa o conhecimento do usuário durante o progresso. Esse curso também possui um interpretador interno para o recebimento instantâneo do feedback no seu aprendizado

source: `Learn to Program in Python with Codeacademy <http://www.codecademy.com/en/tracks/python>`_
pt_br: `Aprenda a Programar em Python com Codeacademy <http://www.codecademy.com/en/tracks/python>`_

source: Intermediate
pt_br: Intermediário

source: Effective Python
pt_br: Python Efetivo

source: This book contains 59 specific ways to improve writing Pythonic code. At 227 pages, it is a very brief overview of some of the most commons adapations programmers need to make to become efficient intermediate level Python programmers.
pt_br: Esse livro contém 59 caminhos específicos para melhorar a escrita de códigos Pythonicos. Com 227 páginas, dá uma breve visão geral de algumas das adaptações mais comuns que programadores precisam fazer para se tornarem eficientes programadores Python de nível intermediário.

source: `Effective Python <http://www.effectivepython.com/>`_
pt_br: `Python Efetivo <http://www.effectivepython.com/>`_

source: Advanced
pt_br: Avançado

source: This book is for intermediate to advanced Python programmers who are looking to understand how and why Python works the way it does and how they can take their code to the next level.
pt_br: Esse livro é indicado para programadores em Python intermediários ou avançados, que estão procurando entender como e porque Python funciona da maneira que funciona, e como levar seus códigos para um proximo nível.

source: Expert Python Programming
pt_br: Programação em Python Expert

source: Expert Python Programming deals with best practices in programming Python and is focused on the more advanced crowd.
pt_br: Programação em Python Expert lida com melhores práticas de programação em Python e tem seu foco no público mais avançado.

source: It starts with topics like decorators (with caching, proxy, and context manager case-studies), method resolution order, using super() and meta-programming, and general :pep:`8` best practices.
pt_br: Ele começa com tópicos como decoradores (com caching, proxy, e estudos de caso de gerenciamento de contexto), ordem de resolução de métodos, usando super() e meta-programação, e práticas gerais :pep:`8`.

source: It has a detailed, multi-chapter case study on writing and releasing a package and eventually an application, including a chapter on using zc.buildout. Later chapters detail best practices such as writing documentation, test-driven development, version control, optimization and profiling.
pt_br: Ele possui um estudo de caso multi-capítulo detalhado sobre a escrita e disponibilização de um pacote e, eventualmente, uma aplicação, incluindo um capítulo sobre como utilizar a zc.buildout. Os últimos capítulos detalham boas práticas como a escrita de documentação, desenvolvimento orientado a testes, controle de versão, otimização e profiling.

source: `Expert Python Programming <http://www.packtpub.com/expert-python-programming/book>`_
pt_br: `Programação em Python Expert <http://www.packtpub.com/expert-python-programming/book>`_

source: A Guide to Python's Magic Methods
pt_br: Um Guia para os Métodos Mágicos de Python

source: This is a collection of blog posts by Rafe Kettler which explain 'magic methods' in Python. Magic methods are surrounded by double underscores (i.e. __init__) and can make classes and objects behave in different and magical ways.
pt_br: Essa é uma coleção de posts de blog escrita por Rafe Kettler que explicam os "métodos mágicos" em Python. Métodos mágicos são acompanhados de dois underlines (ex: __init__) e podem fazer classes e objetos se comportarem de maneira mágica.

source: `A Guide to Python's Magic Methods <http://www.rafekettler.com/magicmethods.html>`_
pt_br: `Um Guia para os Métodos Mágicos do Python <http://www.rafekettler.com/magicmethods.html>`_

source: The Rafekettler.com is currently down, you can go to their Github version directly. Here you can find a PDF version: `A Guide to Python's Magic Methods (repo on GitHub) <https://github.com/RafeKettler/magicmethods/blob/master/magicmethods.pdf>`_
pt_br: O Raffekettler.com atualmente está indisponível, você pode acessar uma versão diretamente no Github. Aqui você pode entrar a versão PDF: `Um Guia para Métodos Magicos do Python (repositório no GitHub) <https://github.com/RafeKettler/magicmethods/blob/master/magicmethods.pdf>`_

source: For Engineers and Scientists
pt_br: Para engenheiros e cientistas

source: A Primer on Scientific Programming with Python, written by Hans Petter Langtangen, mainly covers Python's usage in the scientific field. In the book, examples are chosen from mathematics and the natural sciences.
pt_br: A Primer on Scientific Programming with Python*, escrita por Hans Petter Langtangen, cobre majoritariamente a utilização de Python no meio científico. No livro, exemplos são escolhidos das ciências naturais e exatas. *NT: "Uma Cartilha sobre Programação Científica com Python"

source: Numerical Methods in Engineering with Python, written by Jaan Kiusalaas, puts the emphasis on numerical methods and how to implement them in Python.
pt_br: Numerical Methods in Engineering with Python*, escrito por Jaan Klusalaas, enfatiza nos métodos numéricos e em como implementa-los no Python. NT: "Métodos Números em Engenharia com Python"

source: Miscellaneous topics
pt_br: Tópicos genéricos

source: Problem Solving with Algorithms and Data Structures covers a range of data structures and algorithms. All concepts are illustrated with Python code along with interactive samples that can be run directly in the browser.
pt_br: Problem Solving with Algorithms and Data Structures* cobre uma gama de estruturas de dados e algorítimos. Todos os conceitos são ilustrados com código Python, utilizando exemplos interativos que podem ser executados diretamente do navegador. NT: "Solucionando Problemas com Algorítimos e Estruturas de Dados"

source: Programming Collective Intelligence introduces a wide array of basic machine learning and data mining methods. The exposition is not very mathematically formal, but rather focuses on explaining the underlying intuition and shows how to implement the algorithms in Python.
pt_br: Programming Collective Intelligence introduz a uma ampla lista de métodos de aprendizado de máquina e mineração de dados. A exposição não é muito matemáticamente formal, mas no entanto foca em explicar a intuição subjacente e mostra como implementar os algoritmos em python.

source: The Python Language Reference
pt_br: A Referência da Linguagem Python

source: This is Python's reference manual, it covers the syntax and the core semantics of the language.
pt_br: Este é o manual de referência de Python, ele cobre a sintaxe e a semântica básica da linguagem.

source: `The Python Language Reference <http://docs.python.org/reference/index.html>`_
pt_br: `A Referência da Linguagem Python <http://docs.python.org/reference/index.html>`_

source: Python Essential Reference, written by David Beazley, is the definitive reference guide to Python. It concisely explains both the core language and the most essential parts of the standard library. It covers Python 3 and 2.6 versions.
pt_br: Python Essential Reference, escrito por David Beazley, é a referência definitiva para Python. Ele explica de forma concisa tanto o básico da linguagem quanto partes essenciais da biblioteca padrão. Ele cobre Python nas versões 3 e 2.6.

source: Python Cookbook, written by David Beazley and Brian K. Jones, is packed with practical recipes. This book covers the core python language as well as tasks common to a wide variety of application domains.
pt_br: Python Cookbook, escrito por David Beazley e Brian K. Jones, é cheio de receitas praticas. Esse livro cobre tanto o núcleo da linguagem python como tarefas comuns para uma ampla variedade de domínios de aplicação.

source: "Writing Idiomatic Python", written by Jeff Knupp, contains the most common and important Python idioms in a format that maximizes identification and understanding. Each idiom is presented as a recommendation of a way to write some commonly used piece of code, followed by an explanation of why the idiom is important. It also contains two code samples for each idiom: the "Harmful" way to write it and the "Idiomatic" way.
pt_br: "Writing Idiomatic Python", escrito por Jeff Knupp, contém os mais comuns e importantes Idiomas python em um formato que maximiza identificação e entendimento. Cada idioma é apresentado como uma recomendação de uma maneira de escrever trechos de código comumente usados, seguido de uma explicação do por quê do idioma ser importante. Também contem dois exemplos de código para cada idioma: a maneira "Nociva" de escrever e a "Idiomática".
