Repository: JacksonOsvaldo/python-guide-pt_br
Catalog: docs/locale/*/LC_MESSAGES/scenarios/db.po
Languages: pt_br

source: Databases
pt_br: Bancos de dados

source: The Python Database API (DB-API) defines a standard interface for Python database access modules. It's documented in :pep:`249`. Nearly all Python database modules such as `sqlite3`, `psycopg` and `mysql-python` conform to this interface.
pt_br: A Python Database API (DB-API) define uma interface padrão para módulos de acesso ao banco de dados Python. Está documentado em :pep:`249`. Quase todos os módulos de banco de dados Python, como o `sqlite3`, `psycopg` e `mysql-python`, estão em conformidade com essa interface.

source: Tutorials that explain how to work with modules that conform to this interface can be found `here <http://halfcooked.com/presentations/osdc2006/python_databases.html>`__ and `here <http://web.archive.org/web/20120815130844/http://www.amk.ca/python/writing/DB-API.html>`__.
pt_br: Podem ser encontrados tutoriais que explicam como trabalhar com módulos que estejam em conformidade com esta interface `aqui <http://halfcooked.com/presentations/osdc2006/python_databases.html>`__ e `aqui <http://web.archive.org /web/20120815130844/http://www.amk.ca/python/writing/DB-API.html>`__.

source: `SQLAlchemy <http://www.sqlalchemy.org/>`_ is a commonly used database toolkit. Unlike many database libraries it not only provides an ORM layer but also a generalized API for writing database-agnostic code without SQL.
pt_br: O `SQLAlchemy <http://www.sqlalchemy.org/>`_ é um conjunto de ferramentas de banco de dados comum. Ao contrário de muitas bibliotecas de banco de dados, ele não só fornece uma camada ORM, mas também uma API generalizada para escrever o código agnóstico do banco de dados sem SQL.

source: `Records <https://github.com/kennethreitz/records>`_ is minimalist SQL library, designed for sending raw SQL queries to various databases. Data can be used programmatically, or exported to a number of useful data formats.
pt_br: `Records <https://github.com/kennethreitz/records>`_ é uma biblioteca SQL minimalista, projetada para enviar consultas SQL cruciais para vários bancos de dados. Os dados podem ser usados programaticamente ou exportados para vários formatos de dados úteis.

source: Also included is a command-line tool for exporting SQL data.
pt_br: Também está incluída uma ferramenta de linha de comando para exportação de dados SQL.

source: The Django ORM is the interface used by `Django <http://www.djangoproject.com>`_ to provide database access.
pt_br: O Django ORM é a interface usada pelo `Django <http://www.djangoproject.com>`_ para fornecer acesso ao banco de dados.

source: It's based on the idea of `models <https://docs.djangoproject.com/en/dev/#the-model-layer>`_, an abstraction that makes it easier to manipulate data in Python.
pt_br: Baseia-se na ideia de `modelos <https://docs.djangoproject.com/en/dev/#the-model-layer>`_, uma abstração que facilita a manipulação de dados em Python.

source: The basics:
pt_br: O básico:

source: Each model is a Python class that subclasses django.db.models.Model.
pt_br: Cada modelo é uma classe Python e que é uma subclasse de ``django.db.models.Model``.

source: Each attribute of the model represents a database field.
pt_br: Cada atributo do modelo representa um campo de banco de dados.

source: Django gives you an automatically-generated database-access API; see `Making queries <https://docs.djangoproject.com/en/dev/topics/db/queries/>`__.
pt_br: O Django oferece uma API de acesso ao banco de dados gerada automaticamente; `Making queries <https://docs.djangoproject.com/en/dev/topics/db/queries/>`__.

source: `peewee <http://docs.peewee-orm.com/en/latest/>`_ is another ORM with a focus on being lightweight with support for Python 2.6+ and 3.2+ which supports SQLite, MySQL and Postgres by default. The `model layer <https://peewee.readthedocs.io/en/latest/peewee/quickstart.html#model-definition>`_ is similar to that of the Django ORM and it has `SQL-like methods <https://peewee.readthedocs.io/en/latest/peewee/quickstart.html#retrieving-data>`_ to query data. While SQLite, MySQL and Postgres are supported out-of-the-box, there is a `collection of add-ons <https://peewee.readthedocs.io/en/latest/peewee/playhouse.html#playhouse>`_ available.
pt_br: `peewee <http://docs.peewee-orm.com/en/latest/>`_ é outro ORM com foco em ser leve com suporte para o Python 2.6+ e 3.2+ que suporta SQLite, MySQL e Postgres por padrão. A camada de modelo `model layer <https://peewee.readthedocs.io/en/latest/peewee/quickstart.html#model-definition>`_ é semelhante à do ORM de Django e tem métodos semelhantes a SQL `SQL-like methods <https://peewee.readthedocs.io/en/latest/peewee/quickstart.html#retrieving-data>`_ para consultar dados. Enquanto SQLite, MySQL e Postgres são suportados fora de linha, há uma coleção de complementos `collection of add-ons <https://peewee.readthedocs.io/en/latest/peewee/playhouse.html#playhouse>`_ acessíveis.

source: `PonyORM <http://ponyorm.com/>`_ is an ORM that takes a different approach to querying the database. Instead of writing an SQL-like language or boolean expressions, Python's generator syntax is used. There's also an graphical schema editor that can generate PonyORM entities for you. It supports Python 2.6+ and Python 3.3+ and can connect to SQLite, MySQL, Postgres & Oracle
pt_br: `PonyORM <http://ponyorm.com/>`_ é um ORM que adota uma abordagem diferente para consultar o banco de dados. Em vez de escrever um idioma semelhante ao SQL ou expressões booleanas, a sintaxe do gerador do Python é usada. Há também um editor de esquema gráfico que pode gerar entidades PonyORM para você. Ele suporta Python 2.6+ e Python 3.3+ e pode se conectar a SQLite, MySQL, Postgres e Oracle

source: `SQLObject <http://www.sqlobject.org/>`_ is yet another ORM. It supports a wide variety of databases: Common database systems MySQL, Postgres and SQLite and more exotic systems like SAP DB, SyBase and MSSQL. It only supports Python 2 from Python 2.6 upwards.
pt_br: `SQLObject <http://www.sqlobject.org/>`_ é mais uma ORM. Ele suporta uma grande variedade de bancos de dados: sistemas de banco de dados comuns MySQL, Postgres e SQLite e sistemas mais exóticos, como SAP DB, SyBase e MSSQL. Ele só suporta o Python 2 do Python 2.6 para cima.
