Repository: JacksonOsvaldo/python-guide-pt_br
Catalog: docs/locale/*/LC_MESSAGES/scenarios/json.po
Languages: pt_br

source: The `json <https://docs.python.org/2/library/json.html>`_ library can parse JSON from strings or files. The library parses JSON into a Python dictionary or list. It can also convert Python dictionaries or lists into JSON strings.
pt_br: The `json <https://docs.python.org/2/library/json.html>`_ pode analisar Strings JSON ou arquivos. A biblioteca analisa o JSON em um dicionário ou numa lista Python. Também pode converter dicionários ou listas Python em Strings JSON.

source: Parsing JSON
pt_br: Analisando Arquivos JSON

source: Take the following string containing JSON data:
pt_br: Pegue a seguinte String contendo dados JSON:

source: It can be parsed like this:
pt_br: A mesma pode ser analisado assim:

source: and can now be used as a normal dictionary:
pt_br: e agora pode ser usado como um dicionário normal:

source: You can also convert the following to JSON:
pt_br: Também podemos pode converte-la da seguinte forma para JSON:

source: The JSON library was added to Python in version 2.6. If you're using an earlier version of Python, the `simplejson <https://simplejson.readthedocs.io/en/latest/>`_ library is available via PyPI.
pt_br: A biblioteca JSON foi adicionada ao Python na versão 2.6. Se estivermos usando uma versão anterior do Python, a biblioteca `simplejson <https://simplejson.readthedocs.io/en/latest/>`_ estará disponível via PyPI.

source: simplejson mimics the json standard library. It is available so that developers that use older versions of Python can use the latest features available in the json lib.
pt_br: O simplejson imita a biblioteca padrão do JSON. O mesmo está disponível para que os desenvolvedores que usem versões antigas do Python possam usar os recursos mais recentes disponíveis na biblioteca JSON.

source: You can start using simplejson when the json library is not available by importing simplejson under a different name:
pt_br: Podemos começar a utilizar o ``simplejson`` quando a biblioteca JSON não estiver disponível importando-o com nomes diferentes:

source: After importing simplejson as json, the above examples will all work as if you were using the standard json library.
pt_br: Depois de importar o ``simplejson`` como JSON, os exemplos acima funcionarão como se estivesse usando a biblioteca JSON padrão.
