Repository: JacksonOsvaldo/python-guide-pt_br
Catalog: docs/locale/*/LC_MESSAGES/scenarios/xml.po
Languages: pt_br

source: XML parsing
pt_br: Análise de XML

source: `untangle <https://github.com/stchris/untangle>`_ is a simple library which takes an XML document and returns a Python object which mirrors the nodes and attributes in its structure.
pt_br: `untangle <https://github.com/stchris/untangle>`_ é uma biblioteca simples que recebe um documento XML e retorna um objeto Python contendo os nós e atributos em sua estrutura.

source: For example, an XML file like this:
pt_br: Por exemplo, um arquivo XML como este:

source: can be loaded like this:
pt_br: pode ser carregado assim:

source: and then you can get the child elements name like this:
pt_br: e então podemos obter o nome dos elementos filho assim:

source: untangle also supports loading XML from a string or an URL.
pt_br: O ``untangle`` também suporta o carregamento de XML desde uma String ou desde uma URL.

source: `xmltodict <http://github.com/martinblech/xmltodict>`_ is another simple library that aims at making XML feel like working with JSON.
pt_br: `xmltodict <http://github.com/martinblech/xmltodict>`_ é outra biblioteca simples que visa tornar o sentimento de trabalhar com XML como se fosse JSON.

source: An XML file like this:
pt_br: Um arquivo XML como este:

source: can be loaded into a Python dict like this:
pt_br: pode ser carregado em um dicionário Python como este:

source: and then you can access elements, attributes and values like this:
pt_br: e então podemos acessar os elementos, atributos e valores como estes:

source: xmltodict also lets you roundtrip back to XML with the unparse function, has a streaming mode suitable for handling files that don't fit in memory and supports namespaces.
pt_br: ``xmltodict`` também permite voltarmos para o formato XML com a função unparse, o mesmo também possui um modo de transmissão adequado para transmissão de arquivos que não se encaixam na memória e oferece suporta ao uso de namespaces.
