Repository: JacksonOsvaldo/python-guide-pt_br
Catalog: docs/locale/*/LC_MESSAGES/writing/reading.po
Languages: pt_br

source: Reading Great Code
pt_br: Lendo Ótimos Códigos

source: One of the core tenets behind the design of Python is creating readable code. The motivation behind this design is simple: The number one thing that Python programmers do is read code.
pt_br: Um dos principais conceitos por trás do design do Python é criação de código legíveis. A motivação por trás desse design é simples: a primeira coisa que os programadores Python fazem é ler o código.

source: One of the secrets of becoming a great Python programmer is to read, understand, and comprehend excellent code.
pt_br: Um dos segredos para tornar-se um excelente programador Python é lendo, entendendo e compreendendo códigos excelentes.

source: Excellent code typically follows the guidelines outlined in :ref:`code_style`, and does its best to express a clear and concise intent to the reader.
pt_br: O código excelente geralmente segue as diretrizes descritas em :ref:`code_style`, e faz o melhor para expressar uma intenção clara e concisa para o leitor.

source: Included below is a list of recommended Python projects for reading. Each one of these projects is a paragon of Python coding.
pt_br: Incluído abaixo temos uma lista de projetos Python recomendados para leitura. Cada um desses projetos é um paradigma de codificação Python.

source: `Howdoi <https://github.com/gleitz/howdoi>`_ Howdoi is a code search tool, written in Python.
pt_br: `Howdoi <https://github.com/gleitz/howdoi>`_ Howdoi é uma ferramenta de busca de código, escrito em Python.

source: `Flask <https://github.com/mitsuhiko/flask>`_ Flask is a microframework for Python based on Werkzeug and Jinja2. It's intended for getting started very quickly and was developed with best intentions in mind.
pt_br: `Flask <https://github.com/mitsuhiko/flask>`_ O Flask é um microframework para Python baseado no Werkzeug e Jinja2. O objetivo é obter um avanço inicial rápido e foi desenvolvido tendo as melhores ideias e intenções.

source: `Diamond <https://github.com/python-diamond/Diamond>`_ Diamond is a python daemon that collects metrics and publishes them to Graphite or other backends. It is capable of collecting cpu, memory, network, i/o, load and disk metrics. Additionally, it features an API for implementing custom collectors for gathering metrics from almost any source.
pt_br: `Diamond <https://github.com/python-diamond/Diamond>`_ ``diamond`` é um daemon Python que coleta métricas publicando-as em ``Graphite`` ou em outros backends. É capaz de coletar a CPU, memória, rede, i/o, carga e métricas do uso do disco. Além disso, o mesmo possui uma API para implementação, coletores personalizados para obtenção de métricas de quase qualquer fonte.

source: `Werkzeug <https://github.com/mitsuhiko/werkzeug>`_ Werkzeug started as simple collection of various utilities for WSGI applications and has become one of the most advanced WSGI utility modules. It includes a powerful debugger, full-featured request and response objects, HTTP utilities to handle entity tags, cache control headers, HTTP dates, cookie handling, file uploads, a powerful URL routing system and a bunch of community-contributed addon modules.
pt_br: `Werkzeug <https://github.com/mitsuhiko/werkzeug>`_ O ``werkzeug`` começou como uma simples coleção de vários utilitários para aplicativos WSGI e se tornou um dos módulos de utilidade WSGI mais avançados. O mesmo inclui um poderoso depurador, solicitação completa e objetos de resposta, utilitários HTTP para lidar com tags de entidade, cabeçalhos de controle de cache, datas HTTP, manipulação de cookies, uploads de arquivos, um poderoso sistema de roteamento de URL e um monte de módulos de complemento desenvolvidos pela comunidade.

source: `Requests <https://github.com/kennethreitz/requests>`_ Requests is an Apache2 Licensed HTTP library, written in Python, for human beings.
pt_br: `Requests <https://github.com/kennethreitz/requests>`_ ``request`` é uma biblioteca HTTP habilitada para Apache2, escrita em Python, e desenvolvido para seres humanos.

source: `Tablib <https://github.com/kennethreitz/tablib>`_ Tablib is a format-agnostic tabular dataset library, written in Python.
pt_br: `Tablib <https://github.com/kennethreitz/tablib>`_ O ``tablib`` é uma biblioteca de conjunto de dados tabulares, agnóstica de formato, escrita em Python.

source: Include code examples of exemplary code from each of the projects listed. Explain why it is excellent code. Use complex examples.
pt_br: Incluir exemplos de código demonstrativos de cada um dos projetos listados. Explicar por que o mesmo é um código excelente. Use exemplos complexos.

source: Explain techniques to rapidly identify data structures, algorithms and determine what the code is doing.
pt_br: Explicar técnicas para identificar rapidamente estruturas de dados, algoritmos e determinar o que o código está fazendo.
